

#最简单的range循环
for i in range(10):
    print(i)
    
#############################################
#小于5的循环跳出，continue
for i in range(10):
    if i <5:
        continue
    print("loop:",i)
    
输出内容：
loop: 5
loop: 6
loop: 7
loop: 8
loop: 9 
    
#############################################
#大于5的循环跳出，break

for i in range(10):
    if i > 4:
        break
    print("loop:",i)
    
输出内容：
loop: 0
loop: 1
loop: 2
loop: 3
loop: 4
    
#############################################
#死循环
count = 0
while True:
    print("翠花，你是最棒的！",count)
    count +=1
输出内容：
翠花，你是最棒的！ 1
翠花，你是最棒的！ 2
翠花，你是最棒的！ 3
翠花，你是最棒的！ 4
........

###########################################
#循环固定次数
count = 0
while True:
    print("你是风儿我是傻子！",count)
    count +=1
    if count == 100:
        print("行了，就这儿吧。别送了。")
        break
 
输出内容：
.....
你是风儿我是傻子！ 97
你是风儿我是傻子！ 98
你是风儿我是傻子！ 99
行了，就这儿吧。别送了。

##################################################









